<?php

namespace Database\Seeders;

use App\Models\Municipality;
use Illuminate\Database\Seeder;

class MunicipalitySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $municipalities = [
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'गौमुल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'हिमाली गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'जगन्नाथ गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'खप्तड छेडेदह गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'स्वामी कार्तिक खापर गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'बडिमालिका नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'त्रिवेणी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'बुढीगंगा नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बाजुरा',
                'name' => 'बुढीनन्द नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'मस्टा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'थलारा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'तलकोट गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'सुर्मा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'सैपाल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'दुर्गाथली गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'बिथडचिर गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'केदारसिउ गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'खप्तड छान्ना गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'छबिस पाथीभेरा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'जय पृथ्वी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बझाङ',
                'name' => 'बुंगल नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'लेकम गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'नौगाड गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'ब्यास गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'दुन्हु गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'मर्मा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'अपि हिमाल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'माल्लिकार्जुन गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'महाकाली नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'दार्चुला',
                'name' => 'शैल्यशिखर नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'सिगास गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'शिवनाथ गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'सुर्नाया गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'डिलासैनी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'पञ्चेश्वर गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'दोगडाकेदार गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'मेलौली नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'दशरथचन्द नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'पुर्चौडी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'बैतडी',
                'name' => 'पाटन नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'अलिताल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'अजयमेरु गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'भागेश्वर गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'नवदुर्गा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'गन्यापधुरा गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'अमरगढी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डडेल्धुरा',
                'name' => 'परशुराम नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'सायल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'आदर्श गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'जोरयाल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'बडीकेदार गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'पुर्बीचौकी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'के आई सिंह गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'बोगटान फूडसिल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'दिपायल सिलगढी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'डोटी',
                'name' => 'शिखर नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'ढकारी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'मेल्लेख गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'चौरपाटी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'रामरोशन गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'तुर्मखाद गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'बान्नीगढी जयगढ गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'साँफेबगर नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'मंगलसेन नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'कमलबजार नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'अछाम',
                'name' => 'पञ्चदेवल विनायक नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'चुरे गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'जानकी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'कैलारी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'जोशीपुर गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'मोहन्याल गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'बर्दगोरिया गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'टीकापुर नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'घोडाघोडी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'भजनी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'धनगढी उपमहानगरपालिका',
                'type' => 'उपमहानगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'गौरीगंगा नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'गोदावरी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कैलाली',
                'name' => 'लम्की चुहा नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'बेलडाँडी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'लालझाडी गाउँपालिका',
                'type' => 'गाउँपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'पुनर्वास नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'कृष्णपुर नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'महाकाली नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'बेदकोट नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'बेलौरी नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'भीमदत्त नगरपालिका',
                'type' => 'नगरपालिका',
            ],
            [
                'province' => 'सुदूरपश्चिम प्रदेश',
                'district' => 'कञ्चनपुर',
                'name' => 'शुक्लाफाँटा नगरपालिका',
                'type' => 'नगरपालिका',
            ],
        ];
        foreach ($municipalities as $municipality) {
            Municipality::firstOrCreate($municipality);
        }
    }
}
